#### Terraform Format and Style 🖌`success`
#### shared-services Terraform Initialization ⚙️`success`
#### shared-services Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### shared-services Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mmodule.key_vault.module.key_vault_access_policy.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.key_vault.module.key_vault.data.azurerm_client_config.current: Refreshing state...[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "base" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                      = "Hot"
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                     = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m         = "LRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m        = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                   = false
      [32m+[0m [0m[1m[0mlocation[0m[0m                         = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m               = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m              = "rg-diagnostic-storage-shared-services-eastus"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                             = {
          [32m+[0m [0m"terraform_managed" = "true"
        }

      [32m+[0m [0mblob_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }
    }

[1m  # module.boot_diag_storage.module.diagnostic_storage_account.random_string.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 4
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[1m  # module.boot_diag_storage.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-diagnostic-storage-shared-services-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.container_registry.module.container_registry.azurerm_container_registry.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_container_registry" "base" {
      [32m+[0m [0m[1m[0madmin_enabled[0m[0m       = false
      [32m+[0m [0m[1m[0madmin_password[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0madmin_username[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mlogin_server[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_rule_set[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-container-registry-shared-services-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                 = "Standard"
    }

[1m  # module.container_registry.module.container_registry.random_string.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 4
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[1m  # module.container_registry.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-container-registry-shared-services-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.domain_controllers.module.managed_disk.azurerm_managed_disk.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_managed_disk" "base" {
      [32m+[0m [0m[1m[0mcreate_option[0m[0m        = "Empty"
      [32m+[0m [0m[1m[0mdisk_iops_read_write[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdisk_mbps_read_write[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m         = 60
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m             = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                 = "datadisk-wvm-dc-0-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m  = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_uri[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_type[0m[0m = "Standard_LRS"
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
      [32m+[0m [0m[1m[0mzones[0m[0m                = [
          [32m+[0m [0m"1",
        ]
    }

[1m  # module.domain_controllers.module.managed_disk.azurerm_managed_disk.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_managed_disk" "base" {
      [32m+[0m [0m[1m[0mcreate_option[0m[0m        = "Empty"
      [32m+[0m [0m[1m[0mdisk_iops_read_write[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdisk_mbps_read_write[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m         = 60
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m             = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                 = "datadisk-wvm-dc-1-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m  = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_uri[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_type[0m[0m = "Standard_LRS"
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
      [32m+[0m [0m[1m[0mzones[0m[0m                = [
          [32m+[0m [0m"2",
        ]
    }

[1m  # module.domain_controllers.module.network_interface.azurerm_network_interface.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "base" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "nic-wvm-dc-0-shared-services-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "ip-nic-wvm-dc-0-shared-services-eastus"
          [32m+[0m [0m[1m[0mprimary[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.0.12.10"
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "static"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.domain_controllers.module.network_interface.azurerm_network_interface.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "base" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "nic-wvm-dc-1-shared-services-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "ip-nic-wvm-dc-1-shared-services-eastus"
          [32m+[0m [0m[1m[0mprimary[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = "10.0.12.11"
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "static"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.domain_controllers.module.network_security_group.azurerm_network_security_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "389"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "LDAP"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 100
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "636"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "LDAP SSL"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 110
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "3268"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "LDAP GC"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 120
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[3][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "3269"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "LDAP GC SSL"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 130
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[4][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "88"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "Kerberos"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 140
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[5][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "53"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "DNS"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 150
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[6][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "445"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "SMB,CIFS,SMB2, DFSN, LSARPC, NbtSS, NetLogonR, SamR, SrvSvc"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 160
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[7][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "25"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "SMTP"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 170
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[8][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "135"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "RPC, EPM"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 180
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[9][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "49152-65535"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "RPC, DCOM, EPM, DRSUAPI, NetLogonR, SamR, FRS"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 190
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[10][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "5722"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "RPC, DFSR (SYSVOL)"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 200
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[11][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "123"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "Windows Time"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 210
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "UDP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[12][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "464"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "Kerberos change and set password"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 220
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[13][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "49152-65535"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "DCOM, RPC, EPM"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 230
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "UDP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[14][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "138"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "DFSN, NetLogon, NetBIOS Datagram Service"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 240
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "UDP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[15][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "9389"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "SOAP"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 250
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[16][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "137"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "NetLogon, NetBIOS Name Resolution"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 260
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "UDP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[17][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "139"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "DFSN, NetBIOS Session Service, NetLogon"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-addsallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 270
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "TCP"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.domain_controllers.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.domain_controllers.module.subnet.azurerm_subnet.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.0.12.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "snet-adds-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-transit-hub-shared-services-eastus"
    }

[1m  # module.domain_controllers.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet_network_security_group_association" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                 = (known after apply)
    }

[1m  # module.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_windows_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_password[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0madmin_username[0m[0m             = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m              = "dc-0-shea"
      [32m+[0m [0m[1m[0menable_automatic_updates[0m[0m   = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                   = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m              = -1
      [32m+[0m [0m[1m[0mname[0m[0m                       = "wvm-dc-0-shared-services-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m                   = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m         = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m        = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                       = "Standard_B2s"
      [32m+[0m [0m[1m[0mtags[0m[0m                       = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                       = "1"

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = (known after apply)
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-wvm-dc-0-shared-services-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "WindowsServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "MicrosoftWindowsServer"
          [32m+[0m [0m[1m[0msku[0m[0m       = "2019-Datacenter"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_windows_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_password[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0madmin_username[0m[0m             = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m              = "dc-1-shea"
      [32m+[0m [0m[1m[0menable_automatic_updates[0m[0m   = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                   = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m              = -1
      [32m+[0m [0m[1m[0mname[0m[0m                       = "wvm-dc-1-shared-services-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m                   = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m         = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m        = "rg-active-directory-shared-services-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                       = "Standard_B2s"
      [32m+[0m [0m[1m[0mtags[0m[0m                       = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                       = "2"

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = (known after apply)
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-wvm-dc-1-shared-services-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "WindowsServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "MicrosoftWindowsServer"
          [32m+[0m [0m[1m[0msku[0m[0m       = "2019-Datacenter"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_machine_data_disk_attachment" "base" {
      [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
      [32m+[0m [0m[1m[0mcreate_option[0m[0m             = "Attach"
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mlun[0m[0m                       = 0
      [32m+[0m [0m[1m[0mmanaged_disk_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
    }

[1m  # module.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_machine_data_disk_attachment" "base" {
      [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
      [32m+[0m [0m[1m[0mcreate_option[0m[0m             = "Attach"
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mlun[0m[0m                       = 0
      [32m+[0m [0m[1m[0mmanaged_disk_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
    }

[1m  # module.key_vault.module.key_vault.azurerm_key_vault.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_key_vault" "base" {
      [32m+[0m [0m[1m[0maccess_policy[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-key-vault-shared-services-eastus"
      [32m+[0m [0m[1m[0msku_name[0m[0m            = "standard"
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
      [32m+[0m [0m[1m[0mtenant_id[0m[0m           = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      [32m+[0m [0m[1m[0mvault_uri[0m[0m           = (known after apply)

      [32m+[0m [0mnetwork_acls {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)
        }
    }

[1m  # module.key_vault.module.key_vault.random_string.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 4
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[1m  # module.key_vault.module.key_vault_access_policy.azurerm_key_vault_access_policy.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_key_vault_access_policy" "base" {
      [32m+[0m [0m[1m[0mcertificate_permissions[0m[0m = [
          [32m+[0m [0m"create",
          [32m+[0m [0m"delete",
          [32m+[0m [0m"deleteissuers",
          [32m+[0m [0m"get",
          [32m+[0m [0m"getissuers",
          [32m+[0m [0m"import",
          [32m+[0m [0m"list",
          [32m+[0m [0m"listissuers",
          [32m+[0m [0m"managecontacts",
          [32m+[0m [0m"manageissuers",
          [32m+[0m [0m"setissuers",
          [32m+[0m [0m"update",
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkey_permissions[0m[0m         = [
          [32m+[0m [0m"backup",
          [32m+[0m [0m"create",
          [32m+[0m [0m"decrypt",
          [32m+[0m [0m"delete",
          [32m+[0m [0m"encrypt",
          [32m+[0m [0m"get",
          [32m+[0m [0m"import",
          [32m+[0m [0m"list",
          [32m+[0m [0m"purge",
          [32m+[0m [0m"recover",
          [32m+[0m [0m"restore",
          [32m+[0m [0m"sign",
          [32m+[0m [0m"unwrapKey",
          [32m+[0m [0m"update",
          [32m+[0m [0m"verify",
          [32m+[0m [0m"wrapKey",
        ]
      [32m+[0m [0m[1m[0mkey_vault_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m               = "e7e9c92f-4927-48e5-9042-263c2e65ba36"
      [32m+[0m [0m[1m[0msecret_permissions[0m[0m      = [
          [32m+[0m [0m"backup",
          [32m+[0m [0m"delete",
          [32m+[0m [0m"get",
          [32m+[0m [0m"list",
          [32m+[0m [0m"purge",
          [32m+[0m [0m"recover",
          [32m+[0m [0m"restore",
          [32m+[0m [0m"set",
        ]
      [32m+[0m [0m[1m[0mtenant_id[0m[0m               = "72f988bf-86f1-41af-91ab-2d7cd011db47"
    }

[1m  # module.key_vault.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-key-vault-shared-services-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_transit_hub.module.firewall.azurerm_firewall.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_firewall" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "azfw-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                 = "ip-azfw-shared-services-eastus"
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
        }
    }

[1m  # module.network_transit_hub.module.firewall.azurerm_subnet.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.0.11.0/26",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "AzureFirewallSubnet"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-transit-hub-shared-services-eastus"
    }

[1m  # module.network_transit_hub.module.public_ip_fw.azurerm_public_ip.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "base" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Static"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-fw-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_transit_hub.module.public_ip_vgw.azurerm_public_ip.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "base" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Dynamic"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-vgw-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Basic"
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_transit_hub.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_transit_hub.module.virtual_network.azurerm_virtual_network.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "base" {
      [32m+[0m [0m[1m[0maddress_space[0m[0m       = [
          [32m+[0m [0m"10.0.0.0/16",
        ]
      [32m+[0m [0m[1m[0mguid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "vnet-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0msubnet[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_transit_hub.module.virtual_network_gateway.azurerm_subnet.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.0.10.0/27",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "GatewaySubnet"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-transit-hub-shared-services-eastus"
    }

[1m  # module.network_transit_hub.module.virtual_network_gateway.azurerm_virtual_network_gateway.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network_gateway" "base" {
      [32m+[0m [0m[1m[0mactive_active[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0menable_bgp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mgeneration[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "vgw-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                 = "Basic"
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m                = "Vpn"
      [32m+[0m [0m[1m[0mvpn_type[0m[0m            = "RouteBased"

      [32m+[0m [0mbgp_settings {
          [32m+[0m [0m[1m[0masn[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mpeer_weight[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mpeering_address[0m[0m = (known after apply)
        }

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "pip-vgw-shared-services-eastus"
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }

      [32m+[0m [0mvpn_client_configuration {
          [32m+[0m [0m[1m[0maddress_space[0m[0m        = [
              [32m+[0m [0m"192.168.100.0/24",
            ]
          [32m+[0m [0m[1m[0mvpn_client_protocols[0m[0m = [
              [32m+[0m [0m"SSTP",
            ]

          [32m+[0m [0mroot_certificate {
              [32m+[0m [0m[1m[0mname[0m[0m             = "P2SRootCert"
              [32m+[0m [0m[1m[0mpublic_cert_data[0m[0m = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4VENDQWRtZ0F3SUJBZ0lRSFExcGgwWUM4TGxFcTdpc29SV0ltekFOQmdrcWhraUc5dzBCQVFzRkFEQWIKTVJrd0Z3WURWUVFEREJCQmVuVnlaVkF5VTFKdmIzUkRaWEowTUI0WERUSXdNRFV3TXpBeU1qVTBNRm9YRFRJeApNRFV3TXpBeU5EVTBNRm93R3pFWk1CY0dBMVVFQXd3UVFYcDFjbVZRTWxOU2IyOTBRMlZ5ZERDQ0FTSXdEUVlKCktvWklodmNOQVFFQkJRQURnZ0VQQURDQ0FRb0NnZ0VCQUxrdmVWdHozdWorNEUyUDMrU2xiYzNSejVlUWdnNm8KYmtWd05hdEx6Vkg4aWZnWnlXek1KQzJHNTV3NEZvbGJiMUVvc2FNNGhVMWpEVElyUGJ2RDU3NmQ2a3FzN1RDWQp4R1U5RFZqZ243M01xdWtoRTJkSTgrRzNWbFowcldKN2tzUERZZEJKSi9oQ1BUcU14bGlqSWYzY2ZJbWhOT1B4CnM2YUdoUlpJYVk0QVZRZ2JVZXJjWjdHb0puOXd0dkJsL2VMY0hISEZHV1VCZnJJS3A2Wk1LVnVFamRDR2w4V0YKK29LMytBakpCMkNjbzdBVnZWMjlSR3VGeWF0TkFpdUhYSjc3VkQ2alJPWlFGR25IVmZ6L3pNa1RicHFlY1p3UwpGOE9yUVg4Z3VhRmJobzloejAwSXVyWXA4TVFvbXNQaE14bUdtcEdHNmc5cDR6eE1EVklMOFNrQ0F3RUFBYU14Ck1DOHdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1CMEdBMVVkRGdRV0JCU3NwaTZnNVNPaWl3b2hWd2NHcWp1RUJ2UWgKRkRBTkJna3Foa2lHOXcwQkFRc0ZBQU9DQVFFQUF3UCtMNy9GL2xLQ1BzZWhVYXdjQ0ZYUWk5dTRCRDJzWTJuZgpNVDFFL0ZNRGN1RjZsREJLRHJLZ3NkclNVRjA5Qmxrc2puNmUvdWxFL0NyZHpjYjVvOFlQOWhtNmtvYy80dTdyCk1seWhKYWErV29qR1dsQXNxMmczWWd6ZTFhVXdaVkhvQ0hLSG8vL1Z3anJ0Ynd2bGczYmF4N3d4SGt0dnhIc0YKU0pMalExL2FlSkZUTXkwaEFPeGoySWtVSVNxeFJFNElaVmluNGVZTHJSZWdGVU8zS1BGTjNjS3F2YlNwTmJIdgoxQkcrRjNxUThrc2RuaDhjU2N3V1pYM0l2U2FvRnVCRm84OUVGNWNqNkxRQlBmdXJBZXk4aFdkekJpSHVxc0VDCm8zU3FQK1hrYlhsNWp0cXJpYUVVRS9IU2gvWUFSYnpkTkxINi9RVmJSdTN3K0tEOEtnPT0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            }
        }
    }

[1m  # module.windows_jumpbox.module.network_interface.azurerm_network_interface.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "base" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "nic-wvm-jumpbox-0-shared-services-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg-jumpbox-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "ip-nic-wvm-jumpbox-0-shared-services-eastus"
          [32m+[0m [0m[1m[0mprimary[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.windows_jumpbox.module.network_security_group.azurerm_network_security_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-rdpallow-shared-services"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-jumpbox-shared-services-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Allow"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "*"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "3389"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "Allow RDP"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-rdpallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 100
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-jumpbox-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "VirtualNetwork"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_rule" "base" {
      [32m+[0m [0m[1m[0maccess[0m[0m                      = "Deny"
      [32m+[0m [0m[1m[0mdestination_address_prefix[0m[0m  = "VirtualNetwork"
      [32m+[0m [0m[1m[0mdestination_port_range[0m[0m      = "3389"
      [32m+[0m [0m[1m[0mdirection[0m[0m                   = "Inbound"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "Deny RDP"
      [32m+[0m [0m[1m[0mnetwork_security_group_name[0m[0m = "nsg-rdpallow-shared-services"
      [32m+[0m [0m[1m[0mpriority[0m[0m                    = 110
      [32m+[0m [0m[1m[0mprotocol[0m[0m                    = "*"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-jumpbox-shared-services-eastus"
      [32m+[0m [0m[1m[0msource_address_prefix[0m[0m       = "Internet"
      [32m+[0m [0m[1m[0msource_port_range[0m[0m           = "*"
    }

[1m  # module.windows_jumpbox.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-jumpbox-shared-services-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.windows_jumpbox.module.subnet.azurerm_subnet.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.0.13.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "snet-jumpbox-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-transit-hub-shared-services-eastus"
    }

[1m  # module.windows_jumpbox.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet_network_security_group_association" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                 = (known after apply)
    }

[1m  # module.windows_jumpbox.module.virtual_machine.azurerm_windows_virtual_machine.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_windows_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_password[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0madmin_username[0m[0m             = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m              = "jumpbox-0-shea"
      [32m+[0m [0m[1m[0menable_automatic_updates[0m[0m   = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                   = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m              = -1
      [32m+[0m [0m[1m[0mname[0m[0m                       = "wvm-jumpbox-0-shared-services-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m                   = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m         = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m        = "rg-jumpbox-shared-services-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                       = "Standard_B2s"
      [32m+[0m [0m[1m[0mtags[0m[0m                       = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                       = (known after apply)

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = (known after apply)
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-wvm-jumpbox-0-shared-services-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "WindowsServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "MicrosoftWindowsServer"
          [32m+[0m [0m[1m[0msku[0m[0m       = "2019-Datacenter"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[0m[1mPlan:[0m 56 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./shared-servicestfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./shared-servicestfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*